guix.org
#+TITLE: GNU Guix on Xubuntu: Declarative, Literate & Reproducible
#+DESCRIPTION: GNU Guix channels and manifests
#+AUTHOR: Mètsàtron — Sovereign Weaver
#+LANGUAGE: en
#+PROPERTY: header-args :mkdirp yes :results silent :comments both
#+PROPERTY: header-args:text :comments no
#+PROPERTY: header-args:bash :comments both
#+PROPERTY: header-args:makefile :comments no :padline no

* Intent
A minimal, sovereign Guix install on a Debian-family host, managed from this repo.
We keep privileged steps explicit, package state declarative, and paths inside overlays.
Nothing in here overwrites your shell files directly, it only adds small blocks that tangle into your existing exports files.

* Layout
- Guix channels, profiles, manifests under =all/.config/guix/=
- Helper scripts under =all/.local/bin/=
- Shell exports for PATH added in tiny, self-contained blocks that tangle into =all/.bash_exports= and =all/.zsh_exports=
- No files removed, only appended sections with clear sentinels

** Guix User profile manifests
Tangling target: =all/.config/guix/manifests/core.scm= and friends.
#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/core.scm
(specifications->manifest
 '(
   "git" "git-extras"
   "jq" "direnv" "htop" "btop" "ranger"
   "maak" "guile" "chafa"
   "glibc-locales"   ; for UTF-8 locales
   "procps"
   "nss-certs"       ; TLS certs for HTTPS
   "emacs"           ; or "emacs-pgtk" if you prefer pgtk
   "emacs-vterm"     ; native vterm module for Emacs
   "libvterm"
   "emacs-fzf" "fzf" "fzf-tab"
   "emacs-zoxide" "zoxide"
   "neovim"
   "zsh" "zsh-syntax-highlighting" "zsh-completions" "zsh-autopair"
   "zsh-vi-mode" "zsh-autosuggestions" "zsh-history-substring-search"
   "tmux"
   "moreutils"
   "flatpak"
   "fastfetch" "wfetch" "uwufetch" "macchina"
   "rofi"
   ;; "kitty"
   "deskflow"
   "gimp" "inkscape" "birdtray" "icedove" "gnome-boxes"
   "vlc"
   ;; "audacity"
   "appmenu-gtk-module"
   "cdemu-client" "cdemu-daemon"
   "node"

   "python"
   "python-numpy" "python-sympy" "python-coloredlogs" "python-humanfriendly"
   "python-send2trash" "python-websockets" "python-unidecode" "python-wheel"

   "smem"

   ;; rust/cargo managed via dotcortex-rust-env (rustup) — not Guix
   ;; cargo crates managed via cargo.org
   ;; "starship"
   ;; "ripgrep"      ; now cargo ripgrep
   ;; "fd"           ; now cargo fd-find
   ;; "bat"          ; now cargo bat
   ;; "lsd"

   ;; Require building
   ;; "gwenview"
   ))
#+END_SRC

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/dev.scm
(specifications->manifest
 '(
   "gcc-toolchain"
   "gdb"
   "cmake"
   "pkg-config"
   "meson"
   "ninja"
   "shellcheck"
   "shfmt"
   "bear"
   ))
#+END_SRC

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/root.scm
(specifications->manifest
 '(
   "git" "htop" "jq" "direnv" "btop"
   "maak" "guile"
   "python" "node"
   "glibc-locales"   ; for UTF-8 locales
   "nss-certs"       ; TLS certs for HTTPS
   "neovim"
   "lsd" "ranger"
   "fzf" "emacs-fzf" "fzf-tab"
   "zsh" "zsh-syntax-highlighting" "zsh-completions" "zsh-autopair"
   "zsh-vi-mode" "zsh-autosuggestions" "zsh-history-substring-search"
   "python-numpy" "python-sympy" "python-coloredlogs" "python-humanfriendly"
   "python-send2trash" "python-websockets" "python-unidecode" "python-wheel"
   "moreutils"
   "flatpak"
   ;; "cdemu-client" "cdemu-daemon"

   ;; rust/cargo managed via dotcortex-rust-env (rustup) — not Guix
   ;; "ripgrep"
   ;; "fd"
   ;; "bat"
   ))
#+END_SRC

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/nonguix.scm
;; Nonguix-only user manifest.
;; Start empty so it never breaks builds; add packages you want from Nonguix.
(specifications->manifest
 '(
   ;; Examples (uncomment IF you want them and the nonguix channel is enabled):
   ;; "signal-desktop"
   ;; "google-chrome"         ; proprietary; Nonguix
   ;; "steam"                 ; Nonguix
   ;; "spotify"               ; Nonguix
   ;; "nvidia-driver"         ; Nonguix
   ;; "visual-studio-code"    ; Nonguix
  ))
#+END_SRC

#+BEGIN_SRC scheme :tangle all/.config/guix/manifests/derivations.scm
;; These packages lack substitutions and the derivations.
;; They require extremely heavy local compilation for all dependencies.
;; Tooks 11.5h to compile last time on my X230 turboing @3.4Ghz 92C.

;; What built from source (grouped)
;; Qt 5.15.x stack (big hitter) — triggered by Picard (PyQt5) and partly by KeePassXC:
;; picard-2.13.3 (also pulled quazip-1.5)
   "picard"
   "keepassxc"
;; Qt 6.9.2 stack (another big hitter) — triggered by CoreCtrl and the mGBA Qt frontend:
   "corectrl"
   "mgba"
;; Pandoc + Haskell galaxy (very CPU-intensive) — triggered by pandoc-2.19.2:
   "pandoc"

;; QtDeclarative (both 5.15.16 and 6.9.2) is among the heaviest units here.
;; But the Pandoc/Haskell stack is also a whale when it doesn’t have substitutes.
#+END_SRC

Add more manifests as needed, for example =audio.scm= or =media.scm=. Keep them small and purposeful.

* One-time system bootstrap
Only run once on this machine. This mirrors the upstream manual for a foreign distro install.
#+BEGIN_SRC bash :tangle no
# 0) Prereqs
sudo apt update
sudo apt install -y build-essential git curl xz-utils bzip2

# 1) Download official installer, verify, run
cd /tmp
rm -f guix-install.sh guix-install.sh.sig

# Follow redirects and fail if not 200
curl -fL -o guix-install.sh 'https://git.savannah.gnu.org/cgit/guix.git/plain/etc/guix-install.sh'
# Quick sanity check
head -n 3 guix-install.sh
# Expect to see: #!/bin/sh on the first line
chmod +x guix-install.sh
# Optional: verify PGP signature if you added Guix keys
# Run the installer
sudo ./guix-install.sh

# 2) Authorize substitute servers, improves build time
# ci.guix.gnu.org should be present after installer, we add bordeaux as well if available
if [ -r /usr/share/guix/bordeaux.guix.gnu.org.pub ]; then
  sudo guix archive --authorize < /usr/share/guix/bordeaux.guix.gnu.org.pub
fi

# 3) Enable and start the daemon
sudo systemctl enable --now guix-daemon
systemctl status guix-daemon --no-pager
#+END_SRC

- After installing Guix, run a substitute bench once and apply it to the daemon:
#+BEGIN_SRC bash
make -f all/.mk/guix-substitutes.mk guix-sub-bench guix-sub-apply
#+END_SRC

If the installer complains about guixbuild users, re-run it or create them with =addgroup guixbuild= and =adduser --system= 10 workers linked to that group, which the installer usually handles.

* Channels, manifests, profiles
** Channel pin template (seed only once)
#+BEGIN_SRC scheme :tangle all/.config/guix/channels.scm :mkdirp yes
;; Single source of truth. Tangled only from guix.org.
(list
  (channel
    (name 'guix)
    (url "https://codeberg.org/guix/guix.git")
    (introduction
      (make-channel-introduction
        "9edb3f66fd807b096b48283debdcddccfea34bad"
        (openpgp-fingerprint
         "BBB0 2DDF 2E8C 26C5 7D28  9DDA 013A 06C9 4F2A E8C4"))))
  (channel
    (name 'nonguix)
    (url "https://gitlab.com/nonguix/nonguix")
    (introduction
      (make-channel-introduction
        "897c1a470da759236cc11798f4e0a5f7d4d59fbc"
        (openpgp-fingerprint
         "2A39 3FFF 68F4 EF7A 3D29  12AF 6F51 20A0 22FB B2D5")))))
#+END_SRC

** Guix Git: Declare pull mirror candidates
#+BEGIN_SRC text :tangle all/.config/guix/pull-candidates.ssv :mkdirp yes
https://codeberg.org/guix/guix.git
https://git.cbaines.net/guix/guix
https://git.savannah.gnu.org/git/guix.git
https://mirror.git.savannah.gnu.org/r/guix.git
#+END_SRC

** Guix (bench caches + pull that never re-benchmarks)
#+BEGIN_SRC makefile :tangle all/.mk/guix.mk :mkdirp yes
# all/.mk/guix.mk
ifndef GUIX_MK_INCLUDED
GUIX_MK_INCLUDED := 1

.RECIPEPREFIX := |
SHELL := /bin/bash
.ONESHELL:

GUIX ?= guix
GUIX_HOME := $(HOME)/.config/guix
EXTRA := $(HOME)/.guix-extra-profiles
BENCH_DIR := $(GUIX_HOME)/.bench
PULL_CACHE := $(BENCH_DIR)/pull-url
FALLBACK_PULL_URLS ?= https://git.cbaines.net/guix/guix https://codeberg.org/guix/guix.git https://git.savannah.gnu.org/git/guix.git

.PHONY: guix-dirs guix-pull-bench guix-pull guix-core guix-dev guix-gc guix-nonguix

guix-dirs:
| @chmod +x $(HOME)/.local/bin/guix-mkdirs 2>/dev/null || true
| @$(HOME)/.local/bin/guix-mkdirs
| @mkdir -p $(BENCH_DIR)
# 1) BENCH → writes cache, prints URL (LOUD)
guix-pull-bench: guix-dirs
| set -Eeuo pipefail; \
| BENCH="$(HOME)/DotCortex/all/.local/bin/guix-bench-pull"; \
| [ -x "$$BENCH" ] || { echo "guix-bench-pull not found/executable" >&2; exit 1; }; \
| URL="$$( "$$BENCH" )" || URL=""; \
| if [ -z "$$URL" ]; then echo "No URL found by bench" >&2; exit 1; fi; \
| echo "$$URL" >"$(PULL_CACHE)"; \
| echo "cached: $(PULL_CACHE) → $$URL"; \
| echo "$$URL"

# 2) PULL → uses cached URL if present; NEVER re-bench
guix-pull: guix-dirs
| set -Eeuo pipefail; \
| URL=""; [ -r "$(PULL_CACHE)" ] && URL="$$(tr -d '\r\n' <"$(PULL_CACHE)")"; \
| tried=0; \
| success=0; \
| choose_and_pull() { \
|   u="$$1"; \
|   [ -z "$$u" ] && return 1; \
|   tried=1; \
|   echo "guix pull --url=$$u (cached/fallback)"; \
|   if $(GUIX) pull --url="$$u"; then \
|     success=1; \
|     printf '%s\n' "$$u" >"$(PULL_CACHE)";  # <-- promote last success to cache
|     return 0; \
|   else \
|     return 1; \
|   fi; \
| }; \
| # 1) try cached (if present)
| if [ -n "$$URL" ]; then \
|   choose_and_pull "$$URL" || echo "cached URL failed → trying fallbacks…"; \
| fi; \
| # 2) try fallbacks (skip if equal to cached)
| if [ "$$success" -eq 0 ]; then \
|   for fb in $(FALLBACK_PULL_URLS); do \
|     [ "$$fb" = "$$URL" ] && continue; \
|     if choose_and_pull "$$fb"; then break; fi; \
|   done; \
| fi; \
| # 3) final fallback: plain `guix pull` (no mirror override)
| if [ "$$success" -eq 0 ]; then \
|   if [ "$$tried" -eq 1 ]; then echo "all mirrors failed → falling back to plain 'guix pull'"; else echo "guix pull (no cache present)"; fi; \
|   $(GUIX) pull; \
| fi

guix-core: guix-dirs
| mkdir -p $(EXTRA)/core
| $(GUIX) package -m $(GUIX_HOME)/manifests/core.scm -p $(EXTRA)/core/core

guix-dev: guix-core
| mkdir -p $(EXTRA)/dev
| $(GUIX) package -m $(GUIX_HOME)/manifests/dev.scm -p $(EXTRA)/dev/dev

guix-nonguix: guix-dirs
| mkdir -p $(EXTRA)/nonguix
| $(GUIX) package -m $(GUIX_HOME)/manifests/nonguix.scm -p $(EXTRA)/nonguix/nonguix

guix-gc:
| $(GUIX) gc
endif
#+END_SRC

** Profile directories
We keep explicit profile prefixes under =~/.guix-extra-profiles= so nothing bleeds into your main profile unless you choose so.
#+NAME: guix-dirs
#+BEGIN_SRC bash :tangle all/.local/bin/guix-mkdirs :shebang "#!/usr/bin/env bash"
set -euo pipefail
# Add any profiles you plan to use here:
profiles=(core dev)

for name in "${profiles[@]}"; do
  base="$HOME/.guix-extra-profiles/$name"
  mkdir -p "$base"
  echo "Ensured: $base"
done
#+END_SRC

Tangling target: none, just convention used by scripts below:
- =~/.guix-extra-profiles/core=
- =~/.guix-extra-profiles/dev=

* Apply profiles
#+BEGIN_SRC bash :tangle no
# 1) Ensure profile dirs exist
~/.local/bin/guix-mkdirs

# 2) Apply core manifest to named profile
~/.local/bin/guix-profile-apply core "$HOME/.config/guix/manifests/core.scm"

# 3) (Optional) Apply dev manifest too
# ~/.local/bin/guix-profile-apply dev "$HOME/.config/guix/manifests/dev.scm"
#+END_SRC

* Session wiring for Guix profiles
#+BEGIN_SRC bash :tangle linux/.xsessionrc.d/20-guix-core-profile.sh :shebang "#!/usr/bin/env bash"
# Sourced by Xsession under /bin/sh; never enable nounset here.
GUIX_PROFILE="$HOME/.guix-extra-profiles/core/core"
export GUIX_PROFILE
if [ -r "$GUIX_PROFILE/etc/profile" ]; then
  . "$GUIX_PROFILE/etc/profile"
fi
# The Guix profile sets GIO_EXTRA_MODULES to its own gio/modules dir, which
# contains GIO modules built against Guix GLib (currently 2.83+). System
# binaries (flatpak-session-helper, xdg-desktop-portal) link against the
# system GLib (2.72 on Ubuntu 22.04) and lack newer symbols like
# g_once_init_enter_pointer — causing them to crash on startup.
#
# /etc/X11/Xsession.d/95dbus_update-activation-env runs after this script and
# calls `dbus-update-activation-environment --systemd --all`, which bakes the
# entire current environment — including GIO_EXTRA_MODULES — into the systemd
# user session. Removing it from the systemd session here, before step 95
# runs, prevents it from ever reaching system service processes.
#
# Guix-built apps find their own GIO modules via their compiled-in rpath
# (/gnu/store/.../lib/gio/modules), so this does not break Guix apps.
if systemctl --user is-active --quiet default.target 2>/dev/null; then
  systemctl --user unset-environment GIO_EXTRA_MODULES 2>/dev/null || true
fi
unset GIO_EXTRA_MODULES
#+END_SRC

* GTK appmenu env
#+BEGIN_SRC conf :tangle linux/.config/environment.d/20-gtk-appmenu.conf
GTK_MODULES=appmenu-gtk-module
#+END_SRC

* Helper scripts
Tangling target: =all/.local/bin/guix-profile-apply=, =guix-profile-list=, =guix-gc-safe=, =guix-search=

#+BEGIN_SRC bash :tangle all/.local/bin/guix-profile-apply :shebang "#!/usr/bin/env bash"
set -euo pipefail
# Apply a manifest to a named profile under ~/.guix-extra-profiles/<name>
name="${1:-}"
manifest="${2:-}"
if [ -z "$name" ] || [ -z "$manifest" ]; then
  echo "Usage: $(basename "$0") <profile-name> <manifest.scm>" >&2
  exit 1
fi
base="$HOME/.guix-extra-profiles/$name"
mkdir -p "$base"
guix package -m "$manifest" -p "$base/$name"
echo "Profile updated: $base/$name"
echo "To activate in this shell:"
echo "  GUIX_PROFILE=$base/$name; . \"$GUIX_PROFILE/etc/profile\""
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-profile-list :shebang "#!/usr/bin/env bash"
set -euo pipefail
find "$HOME/.guix-extra-profiles" -maxdepth 2 -type d -name "*-link" 2>/dev/null | sort || true
echo
echo "User generations:"
guix package --list-generations || true
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-gc-safe :shebang "#!/usr/bin/env bash"
set -euo pipefail
echo "Showing store disk usage:"
guix gc --list-live
echo
echo "Running garbage collection for unused items..."
guix gc
echo "Done."
#+END_SRC

#+BEGIN_SRC bash :tangle all/.local/bin/guix-search :shebang "#!/usr/bin/env bash"
set -euo pipefail
if [ $# -eq 0 ]; then
  echo "Usage: $(basename "$0") <query...>" >&2
  exit 1
fi
guix search "$@"
#+END_SRC

