guix.org
** Apply cached Guix pull mirror (no bench)
#+BEGIN_SRC bash :tangle all/.local/bin/guix-apply-pull-url :shebang "#!/usr/bin/env bash" :tangle-mode (identity #o755) :mkdirp yes
# all/.local/bin/guix-apply-pull-url
#!/usr/bin/env bash
set -Eeuo pipefail
BENCH_CACHE="${XDG_CONFIG_HOME:-$HOME/.config}/guix/.bench/pull-url"

RAW="${1:-}"
if [[ -z "$RAW" && -r "$BENCH_CACHE" ]]; then RAW="$(head -n1 "$BENCH_CACHE" | tr -d '\r')"; fi
[[ -n "${RAW:-}" ]] || { echo "guix-apply-pull-url: no URL" >&2; exit 1; }

URL="$(sed -nE 's/.*\b(https?:\/\/[^[:space:]]+).*/\1/p' <<<"$RAW")"
[[ -n "$URL" ]] || { echo "guix-apply-pull-url: unusable line: $RAW" >&2; exit 1; }

echo "Using channel mirror: $URL"
exec guix pull --url="$URL"
#+END_SRC

** Bench fastest Guix channel mirror
#+BEGIN_SRC bash :tangle all/.local/bin/guix-bench-pull :shebang "#!/usr/bin/env bash" :tangle-mode (identity #o755) :mkdirp yes
#!/usr/bin/env bash
# all/.local/bin/guix-bench-pull
set -Eeuo pipefail

BENCH_DIR="${XDG_CONFIG_HOME:-$HOME/.config}/guix/.bench"
CACHE="${BENCH_DIR}/pull-url"
BL="${BENCH_DIR}/pull-blacklist"
SSV="${XDG_CONFIG_HOME:-$HOME/.config}/guix/pull-candidates.ssv"

mkdir -p "$BENCH_DIR"; touch "$BL"

urls_from_ssv() {
  [[ -r "$SSV" ]] || return 1
  awk '
    BEGIN{IGNORECASE=1}
    /^[[:space:]]*#/ {next}           # comments
    NF==0 {next}                      # blank lines
    NR==1 && $1 ~ /^url$/ {next}      # optional header row
    {print $1}                        # first column is the URL
  ' "$SSV"
}

declare -a CANDS=()
if [[ -n "${GUIX_PULL_CANDIDATES:-}" ]]; then
  # space-separated URLs override SSV
  read -r -a CANDS <<< "$GUIX_PULL_CANDIDATES"
else
  mapfile -t CANDS < <(urls_from_ssv || true)
  # final fallback if SSV missing/empty
  if [[ ${#CANDS[@]} -eq 0 ]]; then
    CANDS=( "https://codeberg.org/guix/guix.git"
            "https://git.cbaines.net/guix/guix"
            "https://git.savannah.gnu.org/git/guix.git"
            "https://mirror.git.savannah.gnu.org/r/guix.git" )
  fi
fi

have_git=0; command -v git >/dev/null 2>&1 && have_git=1

probe_git() { # url -> seconds
  local u="$1"
  local t
  t="$( TIMEFORMAT=%R; { time git ls-remote --heads --tags --refs --timeout=12 "$u" >/dev/null 2>&1; } 2>&1 )" || return 1
  printf '%s\n' "$t"
}
probe_tcp() { # host:443 reachable?
  timeout 4 bash -lc "exec 3<>/dev/tcp/$1/443" 2>/dev/null
}

rows=()
for u in "${CANDS[@]}"; do
  grep -qxF "$u" "$BL" && continue
  host="$(sed -n 's#https\?://\([^/]*\).*#\1#p' <<<"$u")"
  probe_tcp "$host" || continue
  t=""
  if [[ $have_git -eq 1 ]]; then
    t="$(probe_git "$u" || true)"
  fi
  [[ -z "$t" ]] && continue
  rows+=("$t $u")
done

# choose the fastest
best="$(printf '%s\n' "${rows[@]}" | sort -n | awk 'NR==1{print $2}')"

if [[ -z "${best:-}" ]]; then
  echo "no-viable-mirror" >&2
  exit 2
fi

printf '%s\n' "$best"
#+END_SRC

** Substitutes bench script (loud, hardcoded list, env-override)
#+BEGIN_SRC bash :tangle all/.local/bin/guix-bench-substitutes :shebang "#!/usr/bin/env bash" :tangle-mode (identity #o755) :mkdirp yes
#!/usr/bin/env bash
set -Eeuo pipefail

read -r -a CANDS <<< "${GUIX_SUB_CANDIDATES:-https://bordeaux.guix.gnu.org https://ci.guix.gnu.org https://substitutes.nonguix.org}"

BENCH_DIR="${XDG_CONFIG_HOME:-$HOME/.config}/guix/.bench"
ORDER_FILE="${BENCH_DIR}/substitute-order"
BL="${BENCH_DIR}/substitute-blacklist"

mkdir -p "$BENCH_DIR"; touch "$BL"

PKGS=(bash coreutils grep sed gzip nss-certs glibc neovim)

rows=()
for u in "${CANDS[@]}"; do
  grep -qxF "$u" "$BL" && { echo "SKIP $u (blacklisted)"; continue; }
  if ! out=$(guix weather -m <(printf '(specifications->manifest (quote (%s)))\n' "${PKGS[*]}") --substitute-urls="$u" 2>&1); then
    echo "SKIP $u (weather error → blacklisted)"
    echo "$u" >>"$BL"
    continue
  fi
  avail=$(printf '%s\n' "$out" | awk '/substitutes available/{print $1}' | tr -d '%')
  sec=$(printf '%s\n' "$out"   | awk '/seconds per request/{print $1}')
  items=$(printf '%s\n' "$out" | awk '/substitutes available/{print $(NF-3)}')
  [[ -z "$avail" || -z "$items" ]] && continue
  printf '%03d %04d %0.3f %s\n' "${avail%.*}" "${items}" "${sec:-999}" "$u"
done | sort -r -n -k1,1 -k2,2 -k3,3g | {
  mapfile -t rows
  if [[ ${#rows[@]} -eq 0 ]]; then
    echo "No usable substitute servers." >&2
    exit 1
  fi
  printf '%s' "${rows[@]}" | awk '{print $4}' | paste -sd' ' -
}
#+END_SRC

** Guix substitutes (bench caches order; apply reads cache only)
#+BEGIN_SRC makefile :tangle all/.mk/guix-substitutes.mk :mkdirp yes
ifndef GUIX_SUB_MK_INCLUDED
GUIX_SUB_MK_INCLUDED := 1
.RECIPEPREFIX := |
SHELL := /bin/bash
.ONESHELL:

GUIX_HOME := $(HOME)/.config/guix
BENCH_DIR := $(GUIX_HOME)/.bench
ORDER_CACHE := $(BENCH_DIR)/substitute-order

# Full candidate set (bench decides)
SUB_CANDS = "https://bordeaux.guix.gnu.org https://ci.guix.gnu.org https://substitutes.nonguix.org https://hydra-guix-129.guix.gnu.org https://mirrors.sjtug.sjtu.edu.cn/guix https://mirror.yandex.ru/mirrors/guix/ https://bordeaux-singapore-mirror.cbaines.net https://bordeaux-us-east-mirror.cbaines.net"

.PHONY: guix-sub-bench guix-sub-apply

guix-sub-bench:
| set -Eeuo pipefail; \
| mkdir -p "$(BENCH_DIR)"; \
| ORDER="$$( GUIX_SUB_CANDIDATES=$(SUB_CANDS) ~/.local/bin/guix-bench-substitutes )" || { echo "bench failed"; exit 1; }; \
| if ! grep -Eq 'https?://[^ ]+' <<<"$$ORDER"; then echo "bench produced no URLs"; exit 1; fi; \
| printf '%s\n' "$$ORDER" >"$(ORDER_CACHE)"; \
| echo "cached: $(ORDER_CACHE) → $$ORDER"

guix-sub-apply:
| set -Eeuo pipefail; \
| [ -s "$(ORDER_CACHE)" ] || { echo "No $(ORDER_CACHE). Run 'guix-sub-bench' first." >&2; exit 1; }; \
| ORDER="$$(tr -d '\r\n' <"$(ORDER_CACHE)")"; \
| grep -Eq 'https?://[^ ]+' <<<"$$ORDER" || { echo "Invalid ORDER in cache"; exit 1; }; \
| \
| # Start from bench result, then append full candidate list, then dedup. \
| CANDS=$(SUB_CANDS); \
| CANDS="$${CANDS#\"}"; CANDS="$${CANDS%\"}"; \
| SUB_URLS="$$ORDER $$CANDS"; \
| SUB_URLS="$$(printf '%s\n' $$SUB_URLS | awk '!seen[$$0]++' | tr '\n' ' ')"; \
| \
| DAEMON_BIN="$$(systemctl show -p ExecStart guix-daemon 2>/dev/null | sed -E 's/^ExecStart=..([^ ]*guix-daemon).*/\1/')"; \
| [[ -x "$$DAEMON_BIN" ]] || DAEMON_BIN="/var/guix/profiles/per-user/root/current-guix/bin/guix-daemon"; \
| sudo mkdir -p /etc/systemd/system/guix-daemon.service.d; \
| tmp="$$(mktemp)"; \
| printf '%s\n[Service]\nEnvironment=GUIX_LOCPATH=/var/guix/profiles/per-user/root/guix-profile/lib/locale\nExecStart=\nExecStart=%s --build-users-group=guixbuild --substitute-urls=\"%s\"\n' \
|   "" "$$DAEMON_BIN" "$$SUB_URLS" >"$$tmp"; \
| sudo install -m 0644 "$$tmp" /etc/systemd/system/guix-daemon.service.d/override.conf; rm -f "$$tmp"; \
| sudo systemctl daemon-reload; sudo systemctl restart guix-daemon; \
| systemctl --no-pager status guix-daemon || true
endif
#+END_SRC

** Nonguix substitutes (own cache; apply reads cache only)
#+BEGIN_SRC makefile :tangle all/.mk/nonguix-substitutes.mk :mkdirp yes
ifndef NONGUIX_SUBS_MK_INCLUDED
NONGUIX_SUBS_MK_INCLUDED := 1

.RECIPEPREFIX := |
SHELL := /bin/bash
.ONESHELL:

BENCH_DIR := $(HOME)/.config/guix/.bench
NONGUIX_SUB_CACHE := $(BENCH_DIR)/nonguix-substitute-order

.PHONY: nonguix-sub-bench nonguix-sub-apply nonguix-authorize-key

nonguix-sub-bench:
| set -Eeuo pipefail; \
| mkdir -p "$(BENCH_DIR)"; \
| ORDER="$$( GUIX_SUB_CANDIDATES='https://substitutes.nonguix.org https://bordeaux.guix.gnu.org https://ci.guix.gnu.org' \
|            ~/.local/bin/guix-bench-substitutes | awk 'NF{last=$$0} END{print last}' )"; \
| if [ -z "$$ORDER" ]; then echo "No ORDER from bench" >&2; exit 1; fi; \
| echo "$$ORDER" >"$(NONGUIX_SUB_CACHE)"; \
| echo "cached: $(NONGUIX_SUB_CACHE) → $$ORDER"; \
| echo "$$ORDER"

nonguix-sub-apply:
| set -Eeuo pipefail; \
| [ -r "$(NONGUIX_SUB_CACHE)" ] || { echo "No $(NONGUIX_SUB_CACHE). Run 'make -f all/.mk/nonguix-substitutes.mk nonguix-sub-bench' first." >&2; exit 1; }; \
| ORDER="$$(tr -d '\r\n' <"$(NONGUIX_SUB_CACHE)")"; \
| if [ -z "$$ORDER" ]; then echo "Empty $(NONGUIX_SUB_CACHE)" >&2; exit 1; fi; \
| DAEMON_BIN="$$(systemctl show -p ExecStart guix-daemon 2>/dev/null | sed -E 's/^ExecStart=..([^ ]*guix-daemon).*/\1/')"; \
| [ -z "$$DAEMON_BIN" -o ! -x "$$DAEMON_BIN" ] && DAEMON_BIN="/var/guix/profiles/per-user/root/current-guix/bin/guix-daemon"; \
| sudo mkdir -p /etc/systemd/system/guix-daemon.service.d; \
| tmp="$$(mktemp)"; \
| printf '%s\n' \
|   "[Service]" \
|   "Environment=GUIX_LOCPATH=/var/guix/profiles/per-user/root/guix-profile/lib/locale" \
|   "ExecStart=" \
|   "ExecStart=$$DAEMON_BIN --build-users-group=guixbuild --substitute-urls=\"$$ORDER\"" \
|   > "$$tmp"; \
| sudo install -m 0644 "$$tmp" /etc/systemd/system/guix-daemon.service.d/override.conf; \
| rm -f "$$tmp"; \
| sudo systemctl daemon-reload; \
| sudo systemctl restart guix-daemon; \
| systemctl --no-pager status guix-daemon || true

nonguix-authorize-key:
| set -Eeuo pipefail; \
| if [ -r /usr/share/guix/nonguix.pub ]; then key=/usr/share/guix/nonguix.pub; \
| elif [ -r /etc/guix/nonguix.pub ]; then key=/etc/guix/nonguix.pub; \
| elif [ -r $(HOME)/DotCortex/all/.config/guix/nonguix-signing-key.pub ]; then key=$(HOME)/DotCortex/all/.config/guix/nonguix-signing-key.pub; \
| else echo "WARNING: nonguix key not found. Put it at all/.config/guix/nonguix-signing-key.pub and rerun." >&2; exit 0; fi; \
| echo "Authorizing nonguix key: $$key"; \
| sudo guix archive --authorize < "$$key"
endif
#+END_SRC

* Substitutes: authorize keys
#+BEGIN_SRC bash :tangle no
set -Eeuo pipefail
if [ -r /usr/share/guix/ci.guix.gnu.org.pub ]; then
  sudo guix archive --authorize < /usr/share/guix/ci.guix.gnu.org.pub
fi
if [ -r /usr/share/guix/bordeaux.guix.gnu.org.pub ]; then
  sudo guix archive --authorize < /usr/share/guix/bordeaux.guix.gnu.org.pub
fi
#+END_SRC

* Batch Emacs (quiet harmless banners)
#+BEGIN_SRC bash :tangle all/.local/bin/emacs-batch-quiet :shebang "#!/usr/bin/env bash"
set -Eeuo pipefail
EMACS_BIN="$(command -v emacs)"
exec /bin/bash -c '
  {
    exec 3>&1
    exec 4>&2
    "'"$EMACS_BIN"'" "$@" \
      2> >(grep -v -E "(no version information available).*(libxml2|librsvg|libm17n-core)" >&4) \
      1>&3
  }
' bash "$@"
#+END_SRC

