all/.local/bin/guix-apply-pull-url
#!/usr/bin/env bash
# Apply cached Guix pull mirror (no bench)

# [[file:../../../guix.org::*Apply cached Guix pull mirror (no bench)][Apply cached Guix pull mirror (no bench):1]]
# all/.local/bin/guix-apply-pull-url
#!/usr/bin/env bash
set -Eeuo pipefail
BENCH_CACHE="${XDG_CONFIG_HOME:-$HOME/.config}/guix/.bench/pull-url"

RAW="${1:-}"
if [[ -z "$RAW" && -r "$BENCH_CACHE" ]]; then RAW="$(head -n1 "$BENCH_CACHE" | tr -d '\r')"; fi
[[ -n "${RAW:-}" ]] || { echo "guix-apply-pull-url: no URL" >&2; exit 1; }

URL="$(sed -nE 's/.*\b(https?:\/\/[^[:space:]]+).*/\1/p' <<<"$RAW")"
[[ -n "$URL" ]] || { echo "guix-apply-pull-url: unusable line: $RAW" >&2; exit 1; }

echo "Using channel mirror: $URL"
exec guix pull --url="$URL"
# Apply cached Guix pull mirror (no bench):1 ends here
