all/.local/bin/guix-bench-substitutes
#!/usr/bin/env bash
# Substitutes bench script (loud, hardcoded list, env-override)

# [[file:../../../guix.org::*Substitutes bench script (loud, hardcoded list, env-override)][Substitutes bench script (loud, hardcoded list, env-override):1]]
#!/usr/bin/env bash
set -Eeuo pipefail

read -r -a CANDS <<< "${GUIX_SUB_CANDIDATES:-https://bordeaux.guix.gnu.org https://ci.guix.gnu.org https://substitutes.nonguix.org}"

BENCH_DIR="${XDG_CONFIG_HOME:-$HOME/.config}/guix/.bench"
ORDER_FILE="${BENCH_DIR}/substitute-order"
BL="${BENCH_DIR}/substitute-blacklist"

mkdir -p "$BENCH_DIR"; touch "$BL"

PKGS=(bash coreutils grep sed gzip nss-certs glibc neovim)

rows=()
for u in "${CANDS[@]}"; do
  grep -qxF "$u" "$BL" && { echo "SKIP $u (blacklisted)"; continue; }
  if ! out=$(guix weather -m <(printf '(specifications->manifest (quote (%s)))\n' "${PKGS[*]}") --substitute-urls="$u" 2>&1); then
    echo "SKIP $u (weather error → blacklisted)"
    echo "$u" >>"$BL"
    continue
  fi
  avail=$(printf '%s\n' "$out" | awk '/substitutes available/{print $1}' | tr -d '%')
  sec=$(printf '%s\n' "$out"   | awk '/seconds per request/{print $1}')
  items=$(printf '%s\n' "$out" | awk '/substitutes available/{print $(NF-3)}')
  [[ -z "$avail" || -z "$items" ]] && continue
  printf '%03d %04d %0.3f %s\n' "${avail%.*}" "${items}" "${sec:-999}" "$u"
done | sort -r -n -k1,1 -k2,2 -k3,3g | {
  mapfile -t rows
  if [[ ${#rows[@]} -eq 0 ]]; then
    echo "No usable substitute servers." >&2
    exit 1
  fi
  printf '%s' "${rows[@]}" | awk '{print $4}' | paste -sd' ' -
}
# Substitutes bench script (loud, hardcoded list, env-override):1 ends here
