guix.org
** Guix Env Bypassing Host Wrapper
#+BEGIN_SRC bash :tangle linux/.local/bin/host-wrap :shebang "#!/usr/bin/env bash" :mkdirp yes
#!/usr/bin/env bash
# Guix Env Bypassing Host Wrapper

set -euo pipefail

# Preserve a sane locale
LANG="${LANG:-C.UTF-8}"
LC_ALL="${LC_ALL:-}"

# Always disable CSD unless explicitly overridden
GTK_CSD="${GTK_CSD:-0}"

# If nocsd is available and LD_PRELOAD is not already set, use it
if [ -z "${LD_PRELOAD-}" ] && [ -e /usr/lib/x86_64-linux-gnu/libgtk3-nocsd.so.0 ]; then
  LD_PRELOAD="/usr/lib/x86_64-linux-gnu/libgtk3-nocsd.so.0"
fi

# Strip Guix profile bins out of PATH for this wrapper only
strip_guix_from_path() {
  local elem out=""
  IFS=':' read -r -a parts <<< "${PATH:-}"
  for elem in "${parts[@]}"; do
    [ -z "$elem" ] && continue
    if [[ "$elem" == "$HOME/.config/guix/current/bin" ]] \
       || [[ "$elem" == "$HOME/.guix-profile/bin" ]] \
       || [[ "$elem" == "$HOME/.guix-extra-profiles/"*"/bin" ]]; then
      continue
    fi
    if [ -z "$out" ]; then
      out="$elem"
    else
      out="$out:$elem"
    fi
  done
  printf '%s\n' "$out"
}

CLEAN_PATH="$(strip_guix_from_path)"

# Now exec the real command in a mostly clean env,
# but keep the bits that matter for X, DBus, global menu, nocsd, Qt and Flatpak metadata.
exec env -i \
  HOME="$HOME" \
  PATH="$CLEAN_PATH" \
  LANG="$LANG" \
  LC_ALL="$LC_ALL" \
  DISPLAY="${DISPLAY:-}" \
  XAUTHORITY="${XAUTHORITY:-}" \
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}" \
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-}" \
  XDG_CURRENT_DESKTOP="${XDG_CURRENT_DESKTOP:-}" \
  XDG_SESSION_TYPE="${XDG_SESSION_TYPE:-}" \
  XDG_CONFIG_HOME="${XDG_CONFIG_HOME:-$HOME/.config}" \
  XDG_DATA_DIRS="${XDG_DATA_DIRS:-}" \
  XDG_DATA_HOME="${XDG_DATA_HOME:-$HOME/.local/share}" \
  GTK_MODULES="${GTK_MODULES:-}" \
  GTK_CSD="$GTK_CSD" \
  LD_PRELOAD="${LD_PRELOAD:-}" \
  QT_QPA_PLATFORMTHEME="${QT_QPA_PLATFORMTHEME:-}" \
  UBUNTU_MENUPROXY="${UBUNTU_MENUPROXY:-1}" \
  "$@"
#+END_SRC

** Neovide → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/neovide-core :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
res="$(xrandr 2>/dev/null | awk '/\*/{print $1; exit}')"
args=(--neovim-bin="$NVIM")
[ -n "${res:-}" ] && args+=(--size="$res")
exec neovide "${args[@]}" "$@"
#+END_SRC

** AstroNvide → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/astronvide :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
res="$(xrandr 2>/dev/null | awk '/\*/{print $1; exit}')"
export NVIM_APPNAME=astronvim
args=(--neovim-bin="$NVIM")
[ -n "${res:-}" ] && args+=(--size="$res")
exec neovide "${args[@]}" "$@"
#+END_SRC

** Goneovim → Guix Neovim
- Create a tiny wrapper so Neovide always uses your Guix nvim:
#+BEGIN_SRC bash :tangle linux/.local/bin/goneovim-core :shebang "#!/usr/bin/env bash"
set -euo pipefail
NVIM="$HOME/.guix-extra-profiles/core/core/bin/nvim"
if goneovim --help 2>&1 | grep -q -- '--nvimpath'; then
  exec goneovim --nvimpath "$NVIM" --maximized "$@"
else
  exec goneovim --neovim-bin "$NVIM" --maximized "$@"
fi
#+END_SRC

** VSCodium settings, Linux
#+BEGIN_SRC json :tangle linux/.config/VSCodium/User/settings.json :mkdirp yes :comments no
{
  "vscode-neovim.neovimExecutablePaths.linux": "nvim",
  "extensions.experimental.affinity": { "asvetliakov.vscode-neovim": 1 },
  "vscode-neovim.debugLogging": true,

  "terminal.integrated.profiles.linux": {
    "Guix zsh (sandbox)": {
      "path": "/bin/sh",
      "args": ["-lc", "exec \"$HOME/.guix-extra-profiles/core/core/bin/zsh\" -l"],
      "overrideName": true
    },
    "Guix zsh (host)": {
      "path": "/usr/bin/flatpak-spawn",
      "args": ["--host", "/bin/sh", "-lc", "exec \"$HOME/.guix-extra-profiles/core/core/bin/zsh\" -l"],
      "overrideName": true
    }
  },
  "terminal.integrated.defaultProfile.linux": "Guix zsh (sandbox)",
  "terminal.integrated.inheritEnv": false,

  "editor.fontFamily": "'SF Mono','SFMono Nerd Font','JetBrainsMono Nerd Font',Menlo,Monaco,'Courier New',monospace",
  "editor.fontLigatures": true,
  "terminal.integrated.fontFamily": "'SFMono Nerd Font Mono','SF Mono','SFMono Nerd Font',monospace",
  "markdown.preview.fontFamily": "'SF Pro Text','SF Pro Display','San Francisco',-apple-system,system-ui,sans-serif",
  "notebook.output.fontFamily": "'SF Pro Text','San Francisco',-apple-system,system-ui,sans-serif",
  "workbench.fontAliasing": "antialiased",
  "workbench.colorTheme": "LainCore",
  "explorer.confirmDragAndDrop": false,
  "explorer.confirmDelete": false,
  "workbench.iconTheme": "se98",
  "workbench.productIconTheme": "Tabler",
  "workbench.activityBar.location": "top",
  "vscode-neovim.compositeKeys": {}
}
#+END_SRC

** Rofi core wrapper (single entry point)
#+BEGIN_SRC bash :tangle linux/.local/bin/rofi-core :shebang "#!/usr/bin/env bash" :mkdirp yes
set -euo pipefail

PROFILE="$HOME/.guix-extra-profiles/core/core"

# Load core Guix profile (PATH, XDG_DATA_DIRS, etc.) if present
if [ -r "$PROFILE/etc/profile" ]; then
  # shellcheck source=/dev/null
  . "$PROFILE/etc/profile"
fi

# Defer everything else to rofi, untouched
exec "$PROFILE/bin/rofi" "$@"
#+END_SRC

* Daily use, cheat-sheet
- Update channels then upgrade user profiles
  #+BEGIN_SRC bash :tangle no
  guix pull
  make guix-core guix-dev
  # Activate a profile in your current shell if you want its tools
  export GUIX_PROFILE="$HOME/.guix-extra-profiles/core/core"
  . "$GUIX_PROFILE/etc/profile"
  #+END_SRC
- Search packages
  #+BEGIN_SRC bash :tangle no
  guix-search neovim
  #+END_SRC
- Roll back a profile
  #+BEGIN_SRC bash :tangle no
  guix package -p "$HOME/.guix-extra-profiles/core/core" --roll-back
  #+END_SRC
- List user generations and extra profiles
  #+BEGIN_SRC bash :tangle no
  guix-profile-list
  #+END_SRC
- Collect garbage safely
  #+BEGIN_SRC bash :tangle no
  guix-gc-safe
  #+END_SRC

* Notes
- Guix Home is intentionally not enabled here, since you use literate dotfiles as the source of truth. We keep Guix focused on packages and profiles.
- If you ever add =nonguix=, you must explicitly authorize its substitute key. Keep that ritual documented alongside the channels pin.
- Guix can install many tools that overlap with apt, snaps, or flatpaks. Prefer one source per tool to reduce path ambiguity.

* Known issue: Inkscape via Guix (pinned note)
:PROPERTIES:
:CREATED:  [2025-09-24]
:END:

Symptoms (current channel snapshot):
- Runtime complains: libxml2 “no version information available”
- Crash from libxslt: undefined symbol ‘inputPush, version LIBXML2_2.4.30’

Repro snippets:
#+BEGIN_SRC bash
guix shell --pure inkscape -- inkscape
# or show what binary actually runs:
REAL="$(readlink -f "$(which inkscape)"; true)"; REAL="${REAL%/inkscape}/.inkscape-real"; echo "$REAL"
LD_DEBUG=libs "$REAL" 2>&1 | grep -E 'libxml2|libxslt' | sed -n '1,80p'
#+END_SRC

Workarounds:
- Prefer distro/Flatpak Inkscape for now.
- Or use a known-good Guix generation *only* for Inkscape:
#+BEGIN_SRC bash
guix describe --generations
guix time-machine --generation=N -- shell --pure inkscape -- inkscape
#+END_SRC

We intentionally skip mixed LD_PRELOAD tricks (fragile across ICU/libxml2).
