linux/.local/bin/host-wrap
#!/usr/bin/env bash
# Guix Env Bypassing Host Wrapper

# [[file:../../../guix.org::*Guix Env Bypassing Host Wrapper][Guix Env Bypassing Host Wrapper:1]]
#!/usr/bin/env bash
# Guix Env Bypassing Host Wrapper

set -euo pipefail

# Preserve a sane locale
LANG="${LANG:-C.UTF-8}"
LC_ALL="${LC_ALL:-}"

# Always disable CSD unless explicitly overridden
GTK_CSD="${GTK_CSD:-0}"

# If nocsd is available and LD_PRELOAD is not already set, use it
if [ -z "${LD_PRELOAD-}" ] && [ -e /usr/lib/x86_64-linux-gnu/libgtk3-nocsd.so.0 ]; then
  LD_PRELOAD="/usr/lib/x86_64-linux-gnu/libgtk3-nocsd.so.0"
fi

# Strip Guix profile bins out of PATH for this wrapper only
strip_guix_from_path() {
  local elem out=""
  IFS=':' read -r -a parts <<< "${PATH:-}"
  for elem in "${parts[@]}"; do
    [ -z "$elem" ] && continue
    if [[ "$elem" == "$HOME/.config/guix/current/bin" ]] \
       || [[ "$elem" == "$HOME/.guix-profile/bin" ]] \
       || [[ "$elem" == "$HOME/.guix-extra-profiles/"*"/bin" ]]; then
      continue
    fi
    if [ -z "$out" ]; then
      out="$elem"
    else
      out="$out:$elem"
    fi
  done
  printf '%s\n' "$out"
}

CLEAN_PATH="$(strip_guix_from_path)"

# Now exec the real command in a mostly clean env,
# but keep the bits that matter for X, DBus, global menu, nocsd, Qt and Flatpak metadata.
exec env -i \
  HOME="$HOME" \
  PATH="$CLEAN_PATH" \
  LANG="$LANG" \
  LC_ALL="$LC_ALL" \
  DISPLAY="${DISPLAY:-}" \
  XAUTHORITY="${XAUTHORITY:-}" \
  DBUS_SESSION_BUS_ADDRESS="${DBUS_SESSION_BUS_ADDRESS:-}" \
  XDG_RUNTIME_DIR="${XDG_RUNTIME_DIR:-}" \
  XDG_CURRENT_DESKTOP="${XDG_CURRENT_DESKTOP:-}" \
  XDG_SESSION_TYPE="${XDG_SESSION_TYPE:-}" \
  XDG_CONFIG_HOME="${XDG_CONFIG_HOME:-$HOME/.config}" \
  XDG_DATA_DIRS="${XDG_DATA_DIRS:-}" \
  XDG_DATA_HOME="${XDG_DATA_HOME:-$HOME/.local/share}" \
  GTK_MODULES="${GTK_MODULES:-}" \
  GTK_CSD="$GTK_CSD" \
  LD_PRELOAD="${LD_PRELOAD:-}" \
  QT_QPA_PLATFORMTHEME="${QT_QPA_PLATFORMTHEME:-}" \
  UBUNTU_MENUPROXY="${UBUNTU_MENUPROXY:-1}" \
  "$@"
# Guix Env Bypassing Host Wrapper:1 ends here
